avilarezende/esp32/sdkconfig.defaults
# Default project configuration.
# The chip family targeted by this firmware. QEMU emulation in ESP-IDF
# supports the original ESP32, so the default target keeps `idf.py qemu`
# working out of the box.
CONFIG_IDF_TARGET="esp32"

# 4 MB flash matches the image size the bundled QEMU expects.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Desktop and mobile browsers send large request headers (user-agent, accept,
# security headers). The default 512-byte limit rejects them with
# "Header fields are too long", so raise it for the configuration portal.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048

# OpenCores Ethernet is a QEMU-only peripheral. sdkconfig.qemu turns it on.
# The CYD overlay turns it off: ESP-IDF 6 removed the in-tree DP83848 PHY.
